@laserpedro I am not getting the errors you are seeing in `us-west-2`. I should have gotten that at plan itself .

`What is the awscc version you are using ? `

```
data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-west-2]
data.aws_caller_identity.current: Read complete after 0s [id=############]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

...
  # awscc_sagemaker_cluster.example will be created
  + resource "awscc_sagemaker_cluster" "example" {
      + cluster_arn     = (known after apply)
      + cluster_name    = "example-cluster"
      + cluster_status  = (known after apply)
      + creation_time   = (known after apply)
      + failure_message = (known after apply)
      + id              = (known after apply)
      + instance_groups = [
          + {
              + current_count               = (known after apply)
              + execution_role              = (known after apply)
              + instance_count              = 1
              + instance_group_name         = "example-group"
              + instance_storage_configs    = [
                  + {
                      + ebs_volume_config = {
                          + volume_size_in_gb = 30
                        }
                    },
                ]
              + instance_type               = "ml.c5.2xlarge"
              + life_cycle_config           = {
                  + on_create     = "on_create_noop.sh"
                  + source_s3_uri = (known after apply)
                }
              + on_start_deep_health_checks = (known after apply)
              + override_vpc_config         = (known after apply)
              + threads_per_core            = (known after apply)
            },
        ]
      + node_recovery   = (known after apply)
      + orchestrator    = (known after apply)
      + tags            = [
          + {
              + key   = "Modified By"
              + value = "AWSCC"
            },
        ]
      + vpc_config      = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + sagemaker_cluster_id = (known after apply)
aws_iam_role.example: Creating...
aws_s3_bucket.example: Creating...
aws_iam_role.example: Creation complete after 1s [id=sagemaker-cluster-role]
aws_iam_role_policy_attachment.sagemaker_full_access: Creating...
aws_iam_role_policy_attachment.sagemaker_full_access: Creation complete after 0s [id=sagemaker-cluster-role-20250715155753745600000002]
aws_s3_bucket.example: Creation complete after 3s [id=sagemaker-cluster-config-20250715155753042900000001]
aws_s3_bucket_public_access_block.example: Creating...
aws_s3_bucket_server_side_encryption_configuration.example: Creating...
aws_iam_role_policy.s3_access: Creating...
aws_s3_object.params: Creating...
aws_s3_object.script: Creating...
aws_iam_role_policy.s3_access: Creation complete after 0s [id=sagemaker-cluster-role:s3-access]
aws_s3_bucket_public_access_block.example: Creation complete after 0s [id=sagemaker-cluster-config-20250715155753042900000001]
aws_s3_object.script: Creation complete after 1s [id=on_create_noop.sh]
aws_s3_object.params: Creation complete after 1s [id=provisioning_parameters.json]
aws_s3_bucket_server_side_encryption_configuration.example: Creation complete after 1s [id=sagemaker-cluster-config-20250715155753042900000001]
awscc_sagemaker_cluster.example: Creating...
awscc_sagemaker_cluster.example: Still creating... [10s elapsed]
awscc_sagemaker_cluster.example: Still creating... [20s elapsed]
awscc_sagemaker_cluster.example: Still creating... [30s elapsed]
awscc_sagemaker_cluster.example: Still creating... [40s elapsed]
awscc_sagemaker_cluster.example: Still creating... [50s elapsed]
awscc_sagemaker_cluster.example: Still creating... [1m0s elapsed]
awscc_sagemaker_cluster.example: Still creating... [1m10s elapsed]
awscc_sagemaker_cluster.example: Still creating... [1m20s elapsed]
awscc_sagemaker_cluster.example: Still creating... [1m30s elapsed]
awscc_sagemaker_cluster.example: Still creating... [1m40s elapsed]
awscc_sagemaker_cluster.example: Still creating... [1m50s elapsed]

```